[
    {
        "name": "Scrambled eggs",
        "img": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2021/12/10/0/FNK_How-To-Scramble-Eggs-A-Step-By-Step-Guide-Beauty-Shot_s4x3.jpg.rend.hgtvcom.616.462.suffix/1639163483390.jpeg",
        "description": "Scrambled eggs are easy to make. But perfect light and creamy scrambled eggs? Those are another story. If you follow the steps below, we promise you'll achieve restaurant-worthy results every time. Step one: be patient. The best scrambled eggs are cooked low and slow.",
        "ingredients": "Mixing bowl, Whisk, Medium nonstick skillet, Rubber spatula, Warm plate for cooked eggs",
        "steps": "Step 1: Beat the Eggs. Crack the eggs into the mixing bowl and whisk them until they're completely blended and you don’t see streaks of yolk and whites. Whisk in 3/4 teaspoon salt and a few grinds of pepper. Step 2: Prep the pan. Heat the nonstick pan over medium-low heat. Add butter to the pan and swirl it around until it melts and coats the pan. If it foams up a lot and starts to brown, take it off the heat immediately and let the pan cool. If the butter browns, you may want to start over with fresh butter. Step 3: Add the eggs. Gently pour in the eggs. Pause to let them heat slightly — you’ll see the egg begin to turn opaque on the bottom of the pan. If they’re start setting rapidly, turn th eheat down even further: gentle heat is essential for creamy eggs. Step 4: Scramble the eggs constantly. Use the spatula to move the eggs across the pan like a bulldozer so they cook evenly. Continue scrambling in this manner without pausing. The key to light, tender scrambled eggs is the long, slow cook and constant movement. Step 5: Add mix-ins. As the eggs start to set, add chopped fresh herbs, or bits of ham or cheese if you'd like. If you’re making toast, now’s the time to cook it. Step 6: Serve the eggs. Gently spoon the eggs onto the warmed plates. "
    },
    {
        "name": "Egg Fry Recipe",
        "img": "https://static.toiimg.com/thumb/53592671.cms?imgsize=295567&width=509&height=340",
        "description": "Egg Fry is an appetizer recipe ideal to serve with green chutney. Eggs fried in crunchy veggies, this easy to make egg recipe is ideal for kids and is sure to be loved by adults too. If you're an egg lover then do try this Egg Fry recipe as it is quite scrumptious and easy-to-make as well. You can prepare this egg recipe on Sundays for your family and kids when you're not in a mood to prepare something elaborate. It will save on a lot of your time and effort.",
        "ingredients": "boiled Eggs , Chili Powder , Ground Black Pepper, Ground Turmeric, Ground Coriander,Salt, Curry Leaves",
        "steps": "Step 1: To prepare this Egg Fry recipe, boil 2 eggs and remove the shells. Cut them into 4 pieces and keep them aside. Meanwhile, take a glass bowl and add rice flour and gram flour together with little salt. Mix all the ingredients. Step 2: Then take another bowl and break the remaining egg in it. Beat it well. Then heat oil in a pan over medium flame. Once the oil is sufficiently hot, dredge the boiled egg pieces in the flour batter and then dip them in the beaten eggs. After coating them properly, pour them to the hot oil and fry them until done. Step 3: Then heat oil in a pan. Saute the ginger and garlic until golden. Add the onions, green chillies and salt. Fry until onions turn golden. Add the fried egg pieces and stir well. Garnish the Egg Fry with coriander leaves and serve it your family and friends. It tastes the best when paired with green chutney."
    },
    {
        "name": "Potato paste",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTO3mQl2w6OeWftIDRDLuVBqxXVK1As9U-xQRqpgZa-X3y-cbY6iZB7pvrxW7jdolLOMLM&usqp=CAU",
        "description": "The potato paste its call in Bengali and Hindi is Aloo vorta. it is a yammy testy item. its eat by rice.",
        "ingredients": "Boiled potato, onion fry, green chilly, salt",
        "steps": "First boil your potato in hot water. then paste the potato and add some onion fry and green chilly and salt. then past all item."
    },
    {
        "name": "Berger",
        "img": "https://realfood.tesco.com/media/images/Burger-31LGH-a296a356-020c-4969-86e8-d8c26139f83f-0-1400x919.jpg",
        "description": "Scrambled eggs are easy to make. But perfect light and creamy scrambled eggs? Those are another story. If you follow the steps below, we promise you'll achieve restaurant-worthy results every time. Step one: be patient. The best scrambled eggs are cooked low and slow.",
        "ingredients": "½ tbsp olive oil, 1 onion, peeled and finely chopped, 1 x 500g pack , British Beef Steak Mince 15% fat , 1 tsp mixed dried herbs, 1 egg, beaten,4 slices mature Cheddar (optional), 4 white rolls few round lettuce leaves, torn, 1 beef tomato, sliced ketchup, to serve (optional)",
        "steps": "Heat the olive oil in a frying pan, add the onion and cook for 5 minutes until softened and starting to turn golden. Set aside. In a bowl, combine the beef mince with the herbs and the egg. Season, add the onions and mix well. Using your hands, shape into 4 patties. Cook the burgers on a preheated barbecue or griddle for 5-6 minutes on each side. While the second side is cooking, lay a slice of cheese on top to melt slightly (if using). Meanwhile, lightly toast the cut-sides of the buns on the barbecue. Fill with the lettuce, burgers and tomato slices. Serve with ketchup, if you like."
    }
]